-- +goose Up
-- +goose StatementBegin

INSERT INTO exercise_group_types (code, name)
VALUES ('legs', '🦵 Ноги'),
       ('press', '📰 Пресс'),
       ('deltas', 'δ Дельты'),
       ('back', '🏋 Спина'),
       ('chest', '🫀 Грудь'),
       ('biceps', '💪 Бицепс'),
       ('triceps', '💪🏻 Трицепс'),
       ('cardio', '🏃 Кардио');

INSERT INTO exercise_types (id, name, url, exercise_group_type_code, rest_in_seconds, accent, units)
VALUES (1, 'Разгибание голени сидя', 'https://disk.yandex.ru/i/nevoPFhHbc8l8g', 'legs', 120,
        'передняя поверхность бедра', 'reps,weight'),
       (2, 'Сгибание голени сидя', 'https://disk.yandex.ru/i/PqkWBjSSNvH-Vg', 'legs', 120,
        'задняя поверхность бедра', 'reps,weight'),
       (3, 'Жим платформы ногами', 'https://disk.yandex.ru/i/UsaW3YjvDRWm3w', 'legs', 180,
        'передняя поверхность бедра', 'reps,weight'),
       (4, 'Подъем ног в висе на локтях', 'https://disk.yandex.ru/i/pkAxqVWTe4L_Xw', 'press', 90,
        'прямая мышца живота', 'reps'),
       (5, 'Обратные разведения в пек-дек', 'https://disk.yandex.ru/i/9lYAV1wr3VjWQQ', 'deltas', 120,
        'задняя дельтовидная мышца', 'reps,weight'),
       (6, 'Протяжка штанги', 'https://disk.yandex.ru/i/0aaEdn5IBOI6zQ', 'deltas', 120, 'средняя дельтовидная мышца', 'reps,weight'),
       (7, 'Подтягивание в гравитроне широким хватом', 'https://disk.yandex.ru/i/jp52K-HTe86iLA', 'back', 120,
        'широчайшая мышца спины', 'reps,weight'),
       (8, 'Вертикальная тяга в рычажном тренажере', 'https://disk.yandex.ru/i/x6qRCfJBGA7tEQ', 'back', 120,
        'широчайшая мышца спины', 'reps,weight'),
       (9, 'Горизонтальная тяга в блочном тренажере с упором в грудь', 'https://disk.yandex.ru/i/DnyJDcPaJLUyCg',
        'back', 120, 'широчайшая мышца спины', 'reps,weight'),
       (10, 'Тяга гантели с упором в скамью', 'https://disk.yandex.ru/i/mU9TIaxDPV6nXw', 'back', 120,
        'широчайшая мышца спины', 'reps,weight'),
       (11, 'Сгибание рук с супинацией гантелями', 'https://disk.yandex.ru/i/LWBPrSeWvxNiUw', 'biceps', 120,
        'двуглавая мышца плеча', 'reps,weight'),
       (12, 'Молотковые сгибания с гантелями', 'https://disk.yandex.ru/i/OvY5i3YGxyi6gw', 'biceps', 120,
        'брахиалис + плечевая мышца', 'reps,weight'),
       (13, 'Жим лежа широким хватом', 'https://disk.yandex.ru/i/w2FIsYgqMQ-RPA', 'chest', 180, 'грудные мышцы', 'reps,weight'),
       (14, 'Жим горизонтально в тренажере TechnoGym', 'https://disk.yandex.ru/i/vyDhCyusHft5VQ', 'chest', 120,
        'грудные мышцы', 'reps,weight'),
       (15, 'Сведение рук в тренажере бабочка', 'https://disk.yandex.ru/i/JADkjm4tiUsAdQ', 'chest', 120,
        'грудные мышцы', 'reps,weight'),
       (16, 'Французский жим с гантелями лежа', 'https://disk.yandex.ru/i/9KPxatabvDYy8g', 'triceps', 120,
        'трехглавая мышца плеча', 'reps,weight'),
       (17, 'Разгибание на трицепс с верхнего блока канатной рукоятью', 'https://disk.yandex.ru/i/sG8luvJYQWNgyg',
        'triceps', 120, 'трехглавая мышца плеча', 'reps,weight'),
       (18, 'Ходьба', '', 'cardio', 0, '', 'minutes'),
       (19, 'Бег на дорожке', '', 'cardio', 0, '', 'minutes'),
       (20, 'Бег на механической дорожке', '', 'cardio', 0, '', 'minutes'),
       (21, 'Велосипед', '', 'cardio', 0, '', 'minutes'),
       (22, 'Отведение бедер сидя в тренажере', 'https://disk.yandex.ru/i/aU_5zkzX8Fz2GA', 'buttocks', 120,
        'средняя ягодичная мышца', 'reps,weight'),
       (23, 'Ягодичный мост в тренажере', 'https://disk.yandex.ru/i/PnZwX-R4nqCZKQ', 'buttocks', 180,
        'большая ягодичная мышца', 'reps,weight'),
       (24, 'Сведение ног сидя', 'https://disk.yandex.ru/i/nkzqZ_5b3QQWIA', 'legs', 120, 'внутренняя поверхность бедра',
        'reps,weight'),
       (25, 'Планка на прямых руках', 'https://disk.yandex.ru/i/CQFjvbbxJc-dHQ', 'press', 90, 'прямая мышца живота',
        'minutes'),
       (41, 'Бассейн', , 'cardio', 0, 'все тело', 'meters'),
       (42, 'Скручивания в тренажере', 'https://disk.yandex.ru/i/Md9Hf1IoB40SLg', 'press', 90, 'Прямые мышцы — отвечает за формирование «кубиков».
Косые — формируют рельеф боков и участвуют в поворотах корпуса.
Поперечная — стабилизирует корпус и поддерживает внутренние органы.', 'reps,weight'),
       (43, 'Жим лежа на наклонной скамье в Смитте', 'https://disk.yandex.ru/i/oaIucAB_6BoBJQ', 'chest', 120,
        'Грудные мышцы (верхняя часть)', 'reps,weight'),
       (44, 'Разведение гантелей на наклонной (30 градусов) скамье', 'https://disk.yandex.ru/i/s7XA4bMajuPIjg', 'chest',
        120, 'Грудные мышцы (верхняя часть)', 'reps,weight'),
       (45, 'Сведение в кроссовере снизу', 'https://disk.yandex.ru/i/D7xu7lTs6Hi7Aw', 'chest', 120,
        'Грудные мышцы (верхняя часть)', 'reps,weight'),
       (46, 'Сведение в кроссовере сверху', 'https://disk.yandex.ru/i/OXn7TJdX-czCoA', 'chest', 120,
        'Грудные мышцы (внутренняя и нижняя часть)', 'reps,weight'),
       (47, 'Пуловер с гантелью', 'https://disk.yandex.ru/i/dgOV9XuAmgfEMQ', 'chest', 120, 'Грудные мышцы',
        'reps,weight');

-- +goose StatementEnd

-- +goose Down
-- +goose StatementBegin
TRUNCATE TABLE exercise_types;
TRUNCATE TABLE exercise_group_types;
-- +goose StatementEnd
